ci4_praktikum/app/Controllers/Api/Auth.php

    public function login()
    {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $model = new UserModel();

        $user = $model->where('username', $username)
                      ->orWhere('useremail', $username)
                      ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
OR `useremail` = 'admin'
 LIMIT 1